tomaskovacik/MegaCore/avr/boards.txt
can128.menu.clock.18_432MHz_external=18.432 MHz external
can128.menu.clock.18_432MHz_external.upload.speed=115200
can128.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.18_432MHz_external.build.f_cpu=18432000L

can128.menu.clock.12MHz_external=12 MHz external
can128.menu.clock.12MHz_external.upload.speed=57600
can128.menu.clock.12MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.12MHz_external.build.f_cpu=12000000L

can128.menu.clock.8MHz_external=8 MHz external
can128.menu.clock.8MHz_external.upload.speed=38400
can128.menu.clock.8MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.8MHz_external.build.f_cpu=8000000L

can128.menu.clock.8MHz_internal=8 MHz internal
can128.menu.clock.8MHz_internal.upload.speed=38400
can128.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
can128.menu.clock.8MHz_internal.build.f_cpu=8000000L

can128.menu.clock.1MHz_internal=1 MHz internal
can128.menu.clock.1MHz_internal.upload.speed=9600
can128.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
can128.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
####  AT90CAN64  ####
#####################

# General
can64.name=AT90CAN64
can64.upload.tool=avrdude
can64.upload.maximum_data_size=4096
can64.bootloader.tool=avrdude
can64.bootloader.unlock_bits=0x3f
can64.bootloader.lock_bits=0x0f
can64.build.core=MCUdude_corefiles
can64.build.variant=64-pin-avr
can64.build.board=AVR_AT90CAN64
can64.build.mcu=at90can64

# Upload port select
can64.menu.bootloader.uart0=Yes (UART0)
can64.menu.bootloader.uart0.upload.maximum_size=64512
can64.menu.bootloader.uart0.upload.protocol=arduino
can64.menu.bootloader.uart0.upload.port=UART0
can64.menu.bootloader.uart0.bootloader.high_fuses=0xd6
can64.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_BIGBOOT.hex

can64.menu.bootloader.uart1=Yes (UART1)
can64.menu.bootloader.uart1.upload.maximum_size=64512
can64.menu.bootloader.uart1.upload.protocol=arduino
can64.menu.bootloader.uart1.upload.port=UART1
can64.menu.bootloader.uart1.bootloader.high_fuses=0xd6
can64.menu.bootloader.uart1.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_BIGBOOT.hex

can64.menu.bootloader.no_bootloader=No bootloader
can64.menu.bootloader.no_bootloader.upload.maximum_size=65536
can64.menu.bootloader.no_bootloader.bootloader.high_fuses=0xd7
can64.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# Brown out detection
can64.menu.BOD.2v7=BOD 2.7V
can64.menu.BOD.2v7.bootloader.extended_fuses=0xf5
can64.menu.BOD.4v1=BOD 4.1V
can64.menu.BOD.4v1.bootloader.extended_fuses=0xfd
can64.menu.BOD.4v0=BOD 4.0V
can64.menu.BOD.4v0.bootloader.extended_fuses=0xfb
can64.menu.BOD.3v9=BOD 3.9V
can64.menu.BOD.3v9.bootloader.extended_fuses=0xf9
can64.menu.BOD.3v8=BOD 3.8V
can64.menu.BOD.3v8.bootloader.extended_fuses=0xf7
can64.menu.BOD.2v6=BOD 2.6V
can64.menu.BOD.2v6.bootloader.extended_fuses=0xf3
can64.menu.BOD.2v5=BOD 2.5V
can64.menu.BOD.2v5.bootloader.extended_fuses=0xf1
can64.menu.BOD.disabled=BOD disabled
can64.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
can64.menu.LTO.Os=LTO disabled
can64.menu.LTO.Os.compiler.c.extra_flags=
can64.menu.LTO.Os.compiler.c.elf.extra_flags=
can64.menu.LTO.Os.compiler.cpp.extra_flags=
can64.menu.LTO.Os.ltoarcmd=avr-ar

can64.menu.LTO.Os_flto=LTO enabled
can64.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
can64.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
can64.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
can64.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
can64.menu.clock.16MHz_external=16 MHz external
can64.menu.clock.16MHz_external.upload.speed=115200
can64.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
can64.menu.clock.16MHz_external.build.f_cpu=16000000L

can64.menu.clock.20MHz_external=20 MHz external
can64.menu.clock.20MHz_external.upload.speed=115200
can64.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
can64.menu.clock.20MHz_external.build.f_cpu=20000000L

can64.menu.clock.18_432MHz_external=18.432 MHz external
can64.menu.clock.18_432MHz_external.upload.speed=115200
can64.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
can64.menu.clock.18_432MHz_external.build.f_cpu=18432000L

can64.menu.clock.12MHz_external=12 MHz external
can64.menu.clock.12MHz_external.upload.speed=57600
can64.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
can64.menu.clock.12MHz_external.build.f_cpu=12000000L

can64.menu.clock.8MHz_external=8 MHz external
can64.menu.clock.8MHz_external.upload.speed=38400
can64.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
can64.menu.clock.8MHz_external.build.f_cpu=8000000L

can64.menu.clock.8MHz_internal=8 MHz internal
can64.menu.clock.8MHz_internal.upload.speed=38400
can64.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
can64.menu.clock.8MHz_internal.build.f_cpu=8000000L

can64.menu.clock.1MHz_internal=1 MHz internal
can64.menu.clock.1MHz_internal.upload.speed=9600
can64.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
can64.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
####  AT90CAN32  ####
#####################

# General
can32.name=AT90CAN32
can32.upload.tool=avrdude
can32.upload.maximum_data_size=2048
can32.bootloader.tool=avrdude
can32.bootloader.unlock_bits=0x3f
can32.bootloader.lock_bits=0x0f
can32.build.core=MCUdude_corefiles
can32.build.variant=64-pin-avr
can32.build.board=AVR_AT90CAN32
can32.build.mcu=at90can32

# Upload port select
can32.menu.bootloader.uart0=Yes (UART0)
can32.menu.bootloader.uart0.upload.maximum_size=31744
can32.menu.bootloader.uart0.upload.protocol=arduino
can32.menu.bootloader.uart0.upload.port=UART0
can32.menu.bootloader.uart0.bootloader.high_fuses=0xd6
can32.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_BIGBOOT.hex

