tomaskovacik/MegaCore/avr/boards.txt
can32.menu.bootloader.uart1=Yes (UART1)
can32.menu.bootloader.uart1.upload.maximum_size=31744
can32.menu.bootloader.uart1.upload.protocol=arduino
can32.menu.bootloader.uart1.upload.port=UART1
can32.menu.bootloader.uart1.bootloader.high_fuses=0xd6
can32.menu.bootloader.uart1.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_BIGBOOT.hex

can32.menu.bootloader.no_bootloader=No bootloader
can32.menu.bootloader.no_bootloader.upload.maximum_size=32768
can32.menu.bootloader.no_bootloader.bootloader.high_fuses=0xd7
can32.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# Brown out detection
can32.menu.BOD.2v7=BOD 2.7V
can32.menu.BOD.2v7.bootloader.extended_fuses=0xf5
can32.menu.BOD.4v1=BOD 4.1V
can32.menu.BOD.4v1.bootloader.extended_fuses=0xfd
can32.menu.BOD.4v0=BOD 4.0V
can32.menu.BOD.4v0.bootloader.extended_fuses=0xfb
can32.menu.BOD.3v9=BOD 3.9V
can32.menu.BOD.3v9.bootloader.extended_fuses=0xf9
can32.menu.BOD.3v8=BOD 3.8V
can32.menu.BOD.3v8.bootloader.extended_fuses=0xf7
can32.menu.BOD.2v6=BOD 2.6V
can32.menu.BOD.2v6.bootloader.extended_fuses=0xf3
can32.menu.BOD.2v5=BOD 2.5V
can32.menu.BOD.2v5.bootloader.extended_fuses=0xf1
can32.menu.BOD.disabled=BOD disabled
can32.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
can32.menu.LTO.Os=LTO disabled
can32.menu.LTO.Os.compiler.c.extra_flags=
can32.menu.LTO.Os.compiler.c.elf.extra_flags=
can32.menu.LTO.Os.compiler.cpp.extra_flags=
can32.menu.LTO.Os.ltoarcmd=avr-ar

can32.menu.LTO.Os_flto=LTO enabled
can32.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
can32.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
can32.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
can32.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
can32.menu.clock.16MHz_external=16 MHz external
can32.menu.clock.16MHz_external.upload.speed=115200
can32.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
can32.menu.clock.16MHz_external.build.f_cpu=16000000L

can32.menu.clock.20MHz_external=20 MHz external
can32.menu.clock.20MHz_external.upload.speed=115200
can32.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
can32.menu.clock.20MHz_external.build.f_cpu=20000000L

can32.menu.clock.18_432MHz_external=18.432 MHz external
can32.menu.clock.18_432MHz_external.upload.speed=115200
can32.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
can32.menu.clock.18_432MHz_external.build.f_cpu=18432000L

can32.menu.clock.12MHz_external=12 MHz external
can32.menu.clock.12MHz_external.upload.speed=57600
can32.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
can32.menu.clock.12MHz_external.build.f_cpu=12000000L

can32.menu.clock.8MHz_external=8 MHz external
can32.menu.clock.8MHz_external.upload.speed=38400
can32.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
can32.menu.clock.8MHz_external.build.f_cpu=8000000L

can32.menu.clock.8MHz_internal=8 MHz internal
can32.menu.clock.8MHz_internal.upload.speed=38400
can32.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
can32.menu.clock.8MHz_internal.build.f_cpu=8000000L

can32.menu.clock.1MHz_internal=1 MHz internal
can32.menu.clock.1MHz_internal.upload.speed=9600
can32.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
can32.menu.clock.1MHz_internal.build.f_cpu=1000000L
